data/WS-Addressing/ws-addressing-61.xml

<?xml version="1.0" ?><S:Envelope xmlns:S="http://www.w3.org/2003/05/soap-envelope"><S:Header><wsa:MessageID xmlns:wsa="http://www.w3.org/2005/08/addressing">uuid:f796062a-40bd-4560-a198-fc45e95aba83</wsa:MessageID><To xmlns="http://www.w3.org/2005/08/addressing">http://localhost:4040/jaxwsa-w3c_s12/cr</To><MessageID xmlns="http://www.w3.org/2005/08/addressing">uuid:38ef73e2-2f02-4af4-ad1d-e1c5cbfa927a</MessageID><ReplyTo xmlns="http://www.w3.org/2005/08/addressing"><Address>http://www.w3.org/2005/08/addressing/anonymous</Address></ReplyTo><Action xmlns="http://www.w3.org/2005/08/addressing">http://example.org/action/echoIn</Action></S:Header><S:Body><ns2:echoIn xmlns:ns2="http://example.org/echo">fault-test1244</ns2:echoIn></S:Body></S:Envelope>